package cn.master.luna.constants;

import lombok.Getter;

/**
 * @author Created by 11's papa on 2025/7/22
 */
@Getter
public enum AreaType {
    A10("10", "其他"),
    A11("11", "主井口"),
    A12("12", "副井口"),
    A13("13", "进风井口"),
    A14("14", "回风井口"),
    A15("15", "主斜坡道"),
    A16("16", "主要巷道分叉点"),
    A17("17", "运输大巷"),
    A18("18", "回风巷"),
    A19("19", "采矿工作面"),
    A20("20", "掘进工作面"),
    A21("21", "井底车场"),
    A22("22", "独头巷道"),
    A23("23", "采空区"),
    A24("24", "中央变电所"),
    A25("25", "采区变电所"),
    A26("26", "排水泵房"),
    A27("27", "避灾硐室"),
    A28("28", "设备维修硐室"),
    A29("29", "爆破器材库"),
    A30("30", "高地压危险区"),
    A31("31", "水害危险区域"),
    A32("32", "发火危险区域"),
    A33("33", "总回风巷"),
    A34("34", "中段分段进风巷"),
    A35("35", "中段分段回风巷"),
    A36("36", "中段马头门"),
    A37("37", "风机硐室"),
    A38("38", "充电硐室"),
    A39("39", "破碎硐室"),
    A40("40", "废弃巷道"),
    ;
    private final String value;
    private final String desc;

    AreaType(String value, String desc) {
        this.value = value;
        this.desc = desc;
    }
}
