package cn.master.luna.constants;

import lombok.Getter;

/**
 * @author Created by 11's papa on 2025/7/16
 */
@Getter
public enum SensorType {
    D0000("0000", "其他", "", ""),
    D0001("0001", "甲烷", "%", "MN"),
    D0002("0002", "风速", "m/s", ""),
    D0003("0003", "环境温度", "℃", "MN"),
    D0004("0004", "一氧化碳", "ppm", "MN"),
    D0005("0005", "风压", "KPa", ""),
    D0006("0006", "负压", "KPa", "MN"),
    D0007("0007", "水仓水位", "m", ""),
    D0008("0008", "硫化氢", "ppm", ""),
    D0009("0009", "水温", "", ""),
    D0010("0010", "氧气", "%", ""),
    D0011("0011", "二氧化碳", "ppm", ""),
    D0012("0012", "粉尘", "mg/m³", "MN"),
    D0013("0013", "湿度", "%", "MN"),
    D0014("0014", "位移", "mm", ""),
    D0015("0015", "降雨量", "mm", ""),
    D0016("0016", "钻孔应力", "MPa", ""),
    D0017("0017", "二氧化硫", "ppm", ""),
    D0018("0018", "氨气", "ppm", "MN"),
    D0019("0019", "一氧化氮", "ppm", ""),
    D0020("0020", "二氧化氮", "ppm", ""),
    D0021("0021", "压力", "MPa", ""),
    D0022("0022", "观测孔水位", "m", ""),
    D0023("0023", "水流量", "m³/s", ""),
    D1000("1000", "其他开关量", "", ""),
    D1001("1001", "局部通风机", "", ""),
    D1002("1002", "风门", "", ""),
    D1003("1003", "风筒状态", "", "KG"),
    D1004("1004", "风向", "", "KG"),
    D1005("1005", "烟雾", "", ""),
    D1006("1006", "主要通风机", "", ""),
    D1007("1007", "声光报警器", "", ""),
    D1008("1008", "辅助通风机", "", "KG"),
    ;

    // 传感器类型编码
    private final String value;
    // 传感器类型描述
    private final String desc;
    // 测点数值单位
    private final String unit;
    // 测点数值类型
    private final String type;

    SensorType(String value, String desc, String unit, String type) {
        this.value = value;
        this.desc = desc;
        this.unit = unit;
        this.type = type;
    }
}
